[
  {
    "id": 106,
    "name": "Jeffrey Ray Nielsen",
    "year": 2008,
    "description": "Jeffrey Ray Nielsen was a congressional aide to U.S. Representative Dana Rohrabacher (R-CA). Rohrabacher personally recommended Nielsen to USC Law School. Nielsen used his position as a Washington, D.C. congressional aide to lure and sexually abuse underage boys, particularly targeting children from church youth groups. One victim, Billy, was 12 years old when Nielsen began his abuse in the mid-1990s. For two years, Nielsen sexually exploited Billy, including in public settings, while working directly for Congressman Rohrabacher. Nielsen brainwashed his victims into these sexual relationships. In March 2008, the 37-year-old Nielsen pleaded guilty to two felony counts of lewd acts upon a child and was sentenced to 36 months in California prison. A police search of his Ladera Ranch home recovered hundreds of graphic images of man-boy and boy-boy sexual abuse material on his computers.",
    "position": ["government official", "congressional aide"],
    "crime": ["child sexual abuse", "child pornography", "lewd acts with child"],
    "tags": ["government official", "republican", "california"]
  },
  {
    "id": 107,
    "name": "Ted Klaudt",
    "year": 2007,
    "description": "Ted Alvin Klaudt was a Republican member of the South Dakota House of Representatives (1999-2006). On May 19, 2007, he was arrested on charges of raping and sexually abusing his 17 and 19-year-old foster daughters as part of a fake 'egg donor examination' scam. As part of a bogus fertility program, Klaudt touched his foster daughters' breasts, penetrated them with his fingers and a vibrator while pretending to conduct examinations in his motel suite in Pierre during the 2005 and 2006 legislative sessions. The foster daughters had been placed in Klaudt's home through a state program for youth transitioning from the juvenile corrections system. Klaudt was convicted on all four counts of second-degree rape and sentenced on January 17, 2008, to 44 years in prison (11 years per count, served consecutively). He also pleaded guilty to witness tampering and received an additional 10-year sentence. The victims later settled a civil lawsuit against him.",
    "position": ["state legislator"],
    "crime": ["rape", "sexual abuse", "witness tampering"],
    "tags": ["state legislator", "republican", "south dakota"]
  },
  {
    "id": 108,
    "name": "Joseph Monteleone Jr.",
    "year": 2007,
    "description": "Joseph Monteleone Jr. was a Republican city councilman in Elyria, Ohio, and owner of Master Pizza. He was charged with sexually imposition and impor for inappropriately touching and molesting three teen girls who worked at his pizza shop. The three victims were ages 13, 15, and 17 at the time of the assaults. After a bench trial in May 2007, he was found guilty of three counts of sexual imposition and two counts of impportuning. Monteleone was sentenced to three years probation and ordered to pay $9,000 in fines or donate $7,500 to Genesis House, a local shelter for women and children who are victims of domestic violence. Following his conviction, Monteleone resigned from the Elyria City Council and sold Master Pizza.",
    "position": ["government official", "business owner"],
    "crime": ["sexual imposition", "child molestation"],
    "tags": ["government official", "republican", "ohio"]
  },
  {
    "id": 109,
    "name": "Patrick Lee McGuire",
    "year": 2007,
    "description": "Patrick Lee McGuire was a Flagler County, Florida commissioner (2001-2004) and former director of the Central Florida Police Benevolent Association. In January 2007, he was arrested and charged with molesting his two adopted daughters. One daughter was 16, another was 24 when they disclosed abuse to authorities. McGuire had repeatedly molested one of the girls beginning when she was between 8-9 years old. He was convicted in 2007 and sentenced to 60 months in federal prison, of which he served 52 months and was released in October 2011. McGuire remains on a 10-year felony probation term with severe restrictions on travel (limited to county), internet access, and contact with minors, plus mandatory curfew.",
    "position": ["government official"],
    "crime": ["child sexual abuse", "molestation of adopted children"],
    "tags": ["government official", "republican", "florida"]
  },
  {
    "id": 111,
    "name": "Donald Thompson",
    "year": 2006,
    "description": "Donald Thompson was a Creek County District Judge in Oklahoma who was convicted in June 2006 of four counts of indecent exposure. Between 2001 and 2003, his court reporter testified that she witnessed Thompson expose himself at least 15 times while on the bench. The allegations became public when a police officer in Thompson's courtroom heard suspicious pumping sounds and discovered that Thompson was using a 'penis pump' during proceedings. Thompson was sentenced to four years in prison and served 20 months before his release. He was required to register as a sex offender and was disbarred by the Oklahoma Supreme Court, which also stripped him of his pension. Thompson claimed the device was a joke from a hunting buddy and that he may have absentmindedly squeezed it, but never intentionally used it to masturbate.",
    "position": ["judge"],
    "crime": ["indecent exposure", "lewdness in court"],
    "tags": ["judge", "oklahoma", "republican"]
  },
  {
    "id": 112,
    "name": "Stephen P. Linnen",
    "year": 2003,
    "description": "Stephen P. Linnen, 32, worked as legal counsel for taxation and education for the Ohio House of Representatives and was a member of the Ohio GOP. In 2003, Linnen was arrested for indecent exposure after approaching women while nude. In a September 2004 plea agreement, Linnen admitted to being responsible for 38 separate incidents in which he confronted women across Central Ohio while naked, wearing only athletic shoes and a knit cap, with a camera, photographing their reactions. He pleaded guilty to 53 counts of misdemeanor public indecency, sexual imposition, and criminal trespassing. Linnen was sentenced to 18 months in jail on September 27, 2004. The Ohio Supreme Court indefinitely suspended his law license in 2006. However, in 2017, the Ohio Supreme Court ruled to reinstate his license, requiring him to remain on probation for three years and be monitored by the Columbus Bar Association.",
    "position": ["government official", "attorney"],
    "crime": ["indecent exposure", "sexual imposition", "public indecency"],
    "tags": ["government official", "attorney", "republican", "ohio"]
  },
  {
    "id": 126,
    "name": "Dan Johnson",
    "year": 2017,
    "description": "Dan Johnson was a Kentucky Republican state legislator and pastor. In December 2017, the Kentucky Center for Investigative Reporting published allegations that Johnson had sexually assaulted a 17-year-old member of his church on New Year's Eve 2012. According to victim Maranda Richmond, Johnson drunkenly sexually assaulted her in his basement. She reported the incident to Louisville Metro Police in April 2013, and they opened an investigation but closed it without charges. When the investigative report was published, Johnson initially denied the allegations on Tuesday, calling them 'totally false' and refusing to resign. On December 13, 2017—days later—Johnson drove onto a bridge in rural Mount Washington, parked his vehicle, and shot himself in the head. He was 57 years old. Johnson had gained national notoriety during his 2016 election campaign for posting racist images of President Barack Obama and his family.",
    "position": ["state legislator", "religious leader"],
    "crime": ["sexual assault", "assault of minor"],
    "tags": ["state legislator", "republican", "kentucky"]
  },
  {
    "id": 135,
    "name": "Brandon Hixon",
    "year": 2018,
    "description": "Brandon Hixon was a 36-year-old Republican state legislator in Idaho, elected to the House of Representatives in 2012. He was among the youngest lawmakers elected to the Idaho Legislature. On January 9, 2018, while under investigation for possible sexual abuse, Hixon died by suicide—a self-inflicted gunshot wound to the head in his Caldwell home. He resigned from the legislature in October 2017 when the allegations surfaced. According to documents released by the Idaho Attorney General's Office, Hixon was accused of sexually abusing two young girls. His ex-wife told police that Hixon had raped and inappropriately touched one alleged victim for approximately 11 years. Hixon was never charged with any crime, as he took his own life before the case could be presented to a grand jury. Police reports indicate Hixon had attempted suicide at least three other times in the recent past.",
    "position": ["state legislator"],
    "crime": ["child sexual abuse"],
    "tags": ["state legislator", "republican", "idaho"]
  },
  {
    "id": 150,
    "name": "Ralph Lee Aaron",
    "year": 2009,
    "description": "Ralph Lee Aaron, 54, was a pastor of Grace Christian Fellowship in Andalusia, Alabama, and previously served as pastor of Victory Baptist Church in the same community. He faced 152 criminal counts including 152 counts of possessing child pornography, three counts of sexual torture, three counts of first-degree sodomy, and eight counts of sexual abuse of children younger than 12 years old. Aaron targeted and sexually abused multiple boys ages 8-12. In 2009, he agreed to consecutive life terms in prison for production of child pornography and first-degree sodomy of multiple child victims under 12 years old. While at his former church in 2005, Aaron was investigated for allegedly making a verbal sexual advance to another youngster, but no charges were filed due to statute of limitations. Aaron was a retired Navy man and had lived in the Andalusia community for about 7 years before his crimes were exposed.",
    "position": ["religious leader", "pastor"],
    "crime": ["child pornography", "sodomy", "child sexual abuse"],
    "tags": ["religious leader", "pastor", "alabama"]
  }
]
